export const apiUrl = 'https://api.nomoreparties.co';

export const resErrors = {
  profile200: 'Данные изменены.',
  nothingFound: 'Ничего не найдено',
  badLogin: 'Вы ввели неправильный логин или пароль.',
  badToken: 'При авторизации произошла ошибка. Переданный токен некорректен.',
  registerError: 'При регистрации пользователя произошла ошибка.',
  profileError: 'При обновлении профиля произошла ошибка.',
  error409: 'Пользователь с таким email уже существует.',
  error404: 'Страница по указанному маршруту не найдена.',
  error500: 'Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз',
}